<?php
/*
* +----------------------------------------------------------------------
* | SF 综合验证授权系统
* +----------------------------------------------------------------------
* | Quotes [ 花开的再灿烂，也有凋谢的一天，致我们过去的青春 ]
* +----------------------------------------------------------------------
* | Author: 陌上花开 <2129876388@qq.com>
* +----------------------------------------------------------------------
* | Date: 2022年1月19日 18:48:32
* +----------------------------------------------------------------------
*/

namespace app\api\event;

use app\api\model\ActionLog;

/**
 * 日志事件
 *
 * @author 陌上花开
 * @since 2022-01-21
 */
class ApiLog
{

    /**
     * 日志执行句柄
     *
     * @author 陌上花开
     * @since 2022-01-21
     */
    public function handle()
    {
        if (request()->isGet() || request()->isPost()) {
            ActionLog::record();
        }
    }
}